tap "lotyp/homebrew-formulae"
tap "homebrew/cask"
tap "ptb/custom"
tap "railwaycat/emacsmacport"

#  ptb
#brew "chromedriver"
brew "e2fsprogs"
brew "fdupes"
brew "gawk"
brew "getmail6"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "gpac"
brew "hub"
brew "imagemagick"
brew "mercurial"
brew "mp4v2"
brew "mtr"
brew "nmap"
brew "openssl"
brew "p7zip"
brew "perl-build"
brew "pinentry-mac"
brew "plenv"
brew "pyenv"
brew "rbenv"
brew "rsync"
brew "selenium-server-standalone"
brew "shellcheck"
brew "shfmt"
brew "sleepwatcher"
# brew "sqlite-client"
# btew "stow"
brew "tag"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "trash"
brew "vcsh"
brew "vim"
brew "yarn"
# brew "homebrew/php/php71"
#brew "ptb/custom/dovecot"
#brew "ptb/custom/ffmpeg"
brew "sdl2"
brew "zimg"
brew "x265"
brew "webp"
brew "wavpack"
brew "libvorbis"
brew "libvidstab"
brew "two-lame"
brew "theora"
brew "tesseract"
brew "speex"
brew "libssh"
brew "libsoxr"
brew "snappy"
brew "schroedinger"
brew "rubberband"
brew "rtmpdump"
brew "opus"
brew "openh264"
brew "opencore-amr"
brew "fontconfig"
brew "libbs2b"
brew "libbluray"
brew "libass"
brew "chromaprint"
#brew "ptb/custom/nginx-full"

# core/dotfiles
brew "aspell"
brew "certbot"
brew "bats-core"
brew "coreutils"
brew "duti"
brew "lotyp/formulae/dockutil"
brew "nano"
brew "stow"
brew "thefuck"
brew "tmux"
brew "topgrade"

# fs/network
brew "bat"
brew "croc"
brew "eza"
brew "httpie"
brew "ssh-copy-id"
brew "tree"
brew "unar"
brew "wget"
brew "zoxide"

# search/grep/diff
brew "fd"
brew "fzf"
brew "git-delta"
brew "gnu-sed"
brew "grep"
brew "jq"
brew "psgrep"
brew "ripgrep"
brew "the_silver_searcher"

# languages/tools
brew "cmake"
# brew "gh"
brew "n"
brew "python@3.13"
brew "ruby"
brew "rust"
brew "shellcheck"

# media
brew "optipng"
brew "uni"

# misc
brew "grip"
